Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Type
The Type class represents the type filter expression.

Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Type.#ctor
Initializes a new instance of the Type class.